package com.qianfeng.test;

public class Demo1 {
	/*
	 * 知识总结:
	 * 1.单例---会
	 * 	>设计模式的定义
	 * 	>单例的定义
	 * 	>单例的具体实现
	 * 	>单例的作用
	 * 	>系统类--Runtime
	 * 2.接口----会
	 * 	>接口的构成
	 * 	>接口的功能
	 * 	>接口的新特性
	 * 	>为什么要有接口--了解
	 * 	  >>当父类是系统类时,我们要给所有的子类添加功能,只能通过接口的形式
	 * 	  >>一个类可以实现多个接口,所以我们可以借助于接口将父类的功能分散,子类实现功能时更加方便
	 * 	  >>接口可以理解为更加彻底的抽象类
	 * 3.多态---会
	 * 	>多态的定义
	 * 	>多态的原理
	 * 	>多态的特性
	 * 
	 * 今天的内容:
	 * 1.继续多态
	 * 2.Object
	 * 3.考试-必须
	 * 
	 * 
	 * 		/*
		 * 实例:防暴犬,搜救犬,导盲犬都去工作,中间还有一个导盲驴也要干活儿,导盲犬和导盲驴都要学习导盲技术
		 * 
		 * 抽象类,抽象方法,接口,继承
		 */
	 
}
