package com.qianfeng.test;

public class Demo1 {
	/*
	 * 知识复习:
	 * 1.排序
	 *  	>冒泡排序---会
	 *  	>选择排序---会
	 *  	>其他排序----了解
	 *  	>时间复杂度和空间复杂度----了解
	 * 2.查找
	 * 		>普通查找
	 * 		>二分查找---会
	 * 3.二维数组---了解
	 * 		>定义
	 * 		>生成
	 *  	>赋值取值
	 *  	>遍历
	 * 4.面向对象基础-----会
	 * 		>面向对象与面向过程的区别
	 * 			从效率考虑面向对象的思想高
	 * 		>类与对象的关系
	 * 5.类与对象----会
	 * 		>创建类
	 * 		>创建对象
	 * 		>画对象的内存图-----了解
	 * 
	 * 今天的内容
	 * 1.多引用指向一个对象---会
	 * 2.匿名对象---了解
	 * 3.static----会
	 * 4.构造方法---会
	 * 5.代码块儿---了解
	 * 6.封装性----会
	 * 
	 */
}
